app/views/admin/items/edit.html.erb

    <th>ジャンル</th>
    <th><%= f.collection_select :genre_id, Genre.all, :id, :name, { prompt:"-- 選択してください --"} %></th>
---
SELECT "genres".* FROM "genres"