app/controllers/admin/homes_controller.rb

def top
  @orders = Order.page(params[:page]).per(10)
---
SELECT "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]