app/controllers/admin/items_controller.rb

def create
  @item = Item.new(item_params)
  @item.save
---
INSERT INTO "items" ("genre_id", "name", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["name", "洋梨のチーズタルト"], ["introduction", "美味しい"], ["price", 1200], ["created_at", "2022-09-29 14:16:53.909183"], ["updated_at", "2022-09-29 14:16:53.909183"]]

def index
  @items = Item.page(params[:page]).per(10)
---
SELECT "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"

def update
  @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]