app/controllers/admin/items_controller.rb

UPDATE "items" SET "updated_at" = ? WHERE "items"."id" = ?  [["updated_at", "2022-09-29 14:16:53.994555"], ["id", 1]]
---
def edit
  @item = Item.find(params[:id])
  @item.update(item_params)