app/controllers/admin/order_details_controller.rb

def update
  @order_detail = OrderDetail.find(params[:id])
  @order_detail.update(making_status: params[:order_detail][:making_status])
  redirect_to admin_order_path(@order_detail.order.id)
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 2], ["updated_at", "2022-10-01 02:20:02.569365"], ["id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]