app/views/admin/orders/show.html.erb

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
      <%= form_with model: order_detail, url:admin_order_detail_path(order_detail.id), method: :patch do |f| %>
      <%= f.select :making_status, OrderDetail.making_statuses_i18n.invert %>