app/controllers/public/addresses_controller.rb

def create
  @address = Address.new(address_params)
  @address.customer_id = current_customer.id
  @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "小沢時男"], ["postal_code", "4001114"], ["address", "山梨県甲斐市打返4-5-19"], ["created_at", "2022-09-30 13:38:07.871388"], ["updated_at", "2022-09-30 13:38:07.871388"]]

def update
  @address = Address.find(params[:id])
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]