app/controllers/public/cart_items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2022-10-01 02:05:17.055070"], ["id", 2]]
---
def update
  @cart_item = CartItem.find(params[:id])
  @cart_item.update(amount: params[:cart_item][:amount])

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]
---
def destroy_all
  CartItem.destroy_all

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 3], ["item_id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 1], ["created_at", "2022-09-30 14:16:39.467139"], ["updated_at", "2022-09-30 14:16:39.467139"]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2022-10-01 02:05:53.095562"], ["id", 2]]
---
def create
  @cart_item = CartItem.new(cart_item_params)
  @cart_item.customer_id = current_customer.id
  if current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id]).present?
     cart_item = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
     cart_item.amount += params[:cart_item][:amount].to_i
     cart_item.save
     redirect_to public_cart_items_path

  elsif @cart_item.save