app/controllers/public/customers_controller.rb

def update
    @customer = current_customer
    @customer.update(customer_params)
---
UPDATE "customers" SET "first_name" = ?, "first_name_kana" = ?, "email" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?

def check
  @customer = Customer.find_by(email: params[:email])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" IS NULL LIMIT ?  [["LIMIT", 1]]

def withdrawl
  @customer = current_customer
  @customer.update(is_active: false)
---
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2022-10-01 02:40:21.896085"], ["id", 3]]