app/controllers/public/homes_controller.rb

SELECT "items".* FROM "items" WHERE "items"."is_active" = ? LIMIT ? OFFSET ?  [["is_active", 1], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."is_active" = ?  [["is_active", 1]]
---
def top
  @items = Item.page(params[:page]).where(is_active: true)