app/controllers/public/items_controller.rb

def index
   @items = Item.page(params[:page]).where(is_active: true).per(8)
---
SELECT "items".* FROM "items" WHERE "items"."is_active" = ? LIMIT ? OFFSET ?  [["is_active", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "items" WHERE "items"."is_active" = ? AND (created_at > '2022-07-29 09:44:59.284027') LIMIT ? OFFSET ?) subquery_for_count  [["is_active", 1], ["LIMIT", 8], ["OFFSET", 0]]