app/controllers/public/orders_controller.rb

SELECT "cart_items".* FROM "cart_items"
---
def confirm
  @cart_items = CartItem.all

INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "postage", "billing_amount", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_details" ("item_id", "order_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", 1], ["order_id", 1], ["price", 1320], ["amount", 1], ["created_at", "2022-09-30 14:55:47.831627"], ["updated_at", "2022-09-30 14:55:47.831627"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
def create
  @order = Order.new(order_params)
  @order.customer = current_customer
 @order.save!
 current_customer.cart_items.each do |cart_item|
    @order_detail = OrderDetail.new
    @order_detail.item_id = cart_item.item_id
    @order_detail.order_id = @order.id
    @order_detail.price = cart_item.item.add_tax_price
    @order_detail.amount = cart_item.amount
    @order_detail.save
   end
   current_customer.cart_items.destroy_all

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
def index
  @orders = current_customer.orders
  @order_details = OrderDetail.all

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
def show
  @order = Order.find(params[:id])
  @total = @order.order_details.inject(0) { |sum, order_detail| sum + order_detail.item.add_tax_price * order_detail.amount }