app/controllers/public/sessions_controller.rb

  def customer_state
  ## 【処理内容1】 入力されたemailからアカウントを1件取得
  @customer = Customer.find_by(email: params[:customer][:email])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "yoshik@mail"], ["LIMIT", 1]]