app/views/public/orders/confirm.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  <tbody>
  <% current_customer.cart_items.each do |cart_item| %>