app/views/public/orders/new.html.erb

<%= f.label :infomation, "登録済み住所から選択" %>
<%= f.select :address_id, options_from_collection_for_select(current_customer.addresses, :id, :address_display) %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 1]]